import telebot
import random

from my_token import TOKEN

bot = telebot.TeleBot(TOKEN)

sovets = [
    'Используйте энергосберегающие лампы и приборы.',
    'Выключайте свет и электроприборы, когда они не используются.',
    'Рассмотрите возможность установки солнечных панелей или ветряков для получения электричества.',
    'Поддерживайте компании, работающие над развитием зеленой энергетики.',
    'Носите с собой многоразовую бутылку для воды.',
    'Отдавайте предпочтение продуктам без упаковки или с минимальной упаковкой.',
    'Используете тканевые сумки для покупок вместо пластиковых пакетов.',
    'Разделяйте мусор на бумагу, стекло, металл и пластик перед отправкой на переработку.',
    'Участвуйте в программах сбора вторсырья в вашем районе.',
    'Пользуйтесь общественным транспортом, велосипедом или ходите пешком при возможности.',
    'Покупайте местные и органические продукты, чтобы поддерживать фермеров, использующих экологически чистые методы выращивания.',
    'Садоводство и огородничество на своем участке также может способствовать сокращению углеродного следа.',
    'Устанавливайте водосберегающую сантехнику, такую как душевые лейки с низким расходом воды.',
    'Поливайте растения рано утром или поздно вечером, чтобы минимизировать испарение.',
    ]

@bot.message_handler(commands=['start'])
def send_welcome(message):
    bot.reply_to(message, "Привет! Я Эко Telegram бот.")

@bot.message_handler(commands=['sovet'])
def send_sovet(msg):
    bot.send_message(msg.chat.id, random.choice(sovets))

bot.polling()
